import CityList from "./components/CityList";
import "./styles.css";
const City = [
  {
    name: "Рівне",
    text:
      "Рівне відоме з 1283 року.Статус міста було надано в 1939 році. У 1939—1991 роках місто називалося Ровно. Протягом семи століть свого існування, будівлі Рівного не раз спалахували страшним вогнем. Але ні кому не вдавалося знищити місто. Працьовиті руки його жителів відбудовували знищене. Рівне розросталось, і нині воно перетворилося у адміністративно-економічний центр Рівненської області, що входить до складу незалежної України. Рівне — місто обласного значення в Україні, обласний центр Рівненської області. Місто розташоване на річці Устя.",
    img: "https://rivne1.tv/pics2/2110/i129069.jpg?1634402034"
  },
  {
    name: "Київ",
    text:
      "Київ — столиця та найбільше місто України, одне з найбільших і найстаріших міст Європи. Розташований у середній течії Дніпра, у північній Наддніпрянщині. Політичний, соціально-економічний, транспортний, освітньо-науковий, історичний, культурний та духовний центр України. У системі адміністративно-територіального устрою України Київ має спеціальний статус, визначений Конституцією, і не входить до складу жодної області, хоча і є адміністративним центром Київської області. Місце розташування центральних органів влади України, іноземних місій, штаб-квартир більшості підприємств і громадських об'єднань, що працюють в Україні.",
    img:
      "https://static.ukrinform.com/photos/2022_02/thumb_files/630_360_1644435525-554.jpg"
  },
  {
    name: "Одеса",
    text:
      "Одеса – місто-порт на північно-західному узбережжі Чорного моря. Це третє за величиною місто України після Києва і Харкова, головний промисловий, культурний, транспортний, науковий і курортний центр Північного Причорномор’я.",
    img: "https://odessa.nezabarom.ua/img/cities/51d8b613d2.jpg"
  },
  {
    name: "Харків",
    text:
      "Харків – одне з найбільших і густонаселених міст України, колишня столиця і великий центр сучасної ділового і культурного життя. Хоча місто досить молоде і історичних пам’яток в ньому не так багато, сучасний Харків знайде чим здивувати!",
    img:
      "https://www.dobovo.com/blog/wp-content/uploads/2017/07/%D0%95%D0%B4%D0%B5%D0%BC-%D0%B2-%D0%A5%D0%B0%D1%80%D1%8C%D0%BA%D0%BE%D0%B2-%D1%82%D0%BE%D0%BF-10-%D0%BC%D0%B5%D1%81%D1%82-825x510.jpg"
  }
];
export default function App() {
  return (
    <div className="App">
      <h1>Міста України: </h1>
      <CityList City={City} />
    </div>
  );
}
